print("Hi World") #コード修正

# リポジトリは保存場所。変更履歴を全て保存する場所。Gituhubはリモートのリポジトリ。Localリポジトリ（PC）もある。
# リポジトリはバージョン管理と共有に焦点がある。
# コミットとは、リポジトリに保存されている変更されたスナップショット。変更された内容を1つのコミットとして保存し、その履歴を管理する。
# ステージングエリア：コミットする前にどの変更を含めるかを一時的に保存する場所。コミットする前にどの変更を含めるか一時的に保存・確認する。
# ブランチ：プロジェクトの分岐点。通常メインやマスターブランチから新しいブランチをつくり、後で統合（マージ）する事が出来る。
# pull：リモートリポジトリを最新の変更をローカルに取得する事。
# push：ローカルへの変更をリモートリポジトリに変更する事。
# ソース管理を行う前にユーザー設定が必要。
# git config --global user.name "Lecture"
# git config --global user.email "algarabia0427@gmail.com"